#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>


//题2 程序的执行结果为
//int main()
//{
//	unsigned char a = 200;
//	unsigned char b = 100;
//	unsigned char c = 0;
//	c = a + b;
//	printf("%d %d", a + b, c);//以%d的形式打印我认为内存中放的是有符号数的补码
//	return 0;
//}
//00000000000000000000000011001000 - 200
//00000000000000000000000001100100 - 100
//放到unsigned char类型的变量中，发生截断
//11001000 - a
//01100100 - b
//运算时，自身大小达不到整型大小，发生整型提升
//00000000000000000000000011001000 - a
//00000000000000000000000001100100 - b
//00000000000000000000000100101100 - a + b(不存就没有截断)
//放入c时发生截断
//00101100 - 44
//打印部分有两个注意(1)(2)
//以%d的形式打印c时要对c进行整型提升(1)，unsigned char高位直接补0
//00000000000000000000000000101100
//打印时打印原码(2)，正数原反补相同


//测试
//#include<string.h>
//int main()
//{
//	char arr[] = { '1','2','3' };
//	printf("%d\n", strlen(arr));//输出15
//	return 0;
//}

//题4 下面代码的结果是
//int main()
//{
//	char a[1000] = { 0 };
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}
//char一般是signed char,-128-127


//题6 猜名次
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次

//穷举 把可能性都罗列出来，然后逐个看结果
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1; a <= 5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						//a:判断条件这样写更简单: (b==2) + (a==3) == 1
//						if (((b == 2 || a == 3)&&((b == 2 && a == 3)==0)) && ((b == 2 || e == 4)&& ((b == 2 && e == 4)==0)) && ((c == 1 || d == 2)&& ((c == 1 && d == 2)==0)) && ((c == 5 || d == 3)&&((c == 5 && d == 3)==0)) && ((e == 4 || a == 1)&&((e == 4 && a == 1)==0)))
//						{
//							//排除重复（担心有其他组合能乘出120，可以再加一个条件（mtc））
//							if((a*b*c*d*e == 120)&&(a+b+c+d+e==15))
//								printf("a=%d b=%d c=%d d=%d e=%d\n", a, b, c, d, e);
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}

//同类型 题7 猜凶手
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话
//现在请根据这些信息，写一个程序来确定到底谁是凶手
//int main()
//{
//	char arr[] = "ABCD";
//    int i = 0;
//	//for(guess = 'a';guess <= 'd';guess++)
//	for (i = 0; i < 4; i++)
//	{
//		char guess = arr[i];
//		//()+()+()+() == 3;
//		if ((guess != 'A') + (guess == 'C') + (guess == 'D') + (guess != 'D') == 3)
//		{
//			printf("%c", arr[i]);
//		}
//	}
//	return 0;
//}


//在屏幕上打印杨辉三角
//void put(int n, int* arr,int j)
//{
//	if (n != 0)
//	{
//		int a = 0;
//		a = arr[j - 1] + arr[j];
//		printf("%d ", a);
//		/*n = n - 1;
//		j = j + 1;*/
//		put(--n, arr, ++j);
//		arr[j-1] = a;
//	}
//}
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int i = 0;
//	int arr[50];//我:c99标准用变量n初始化数组大小
//	for (i = 0; i < n; i++)
//	{
//		arr[i] = 1;
//	}
//	for (i = 1; i <= n; i++)
//	{
//		//先讨论从第三行开始 i = 3
//		if (i == 1)
//		{
//			printf("1\n");
//		}
//		else if (i == 2)
//		{
//			printf("1 1\n");
//		}
//		else
//		{
//			printf("1 ");
//			int j = 1;
//			put(i - 2, arr, j);
//			printf("1\n");
//		}
//	}
//	return 0;
//}

//a:(重要)
//1
//1 1
//1 2 1
//1 3 3 1
//1 4 6 4 1
//
int main()
{
	int arr[10][10] = { 0 };
	int i = 0;
	int j = 0;
	for (i = 0; i < 10; i++)
	{
		for (j = 0; j <= i; j++)//注意点："j <= i"
		{
			if (j == 0)
				arr[i][j] = 1;
			else if (j == i)
				arr[i][j] = 1;
			else
				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
		}
	}
	for (i = 0; i < 10; i++)
	{
		for (j = 0; j <= i; j++)//注意点:"j <= i"
		{
			printf("%d ", arr[i][j]);
		}
		printf("\n");
	}
	return 0;
}
