#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<string.h>

//写一个函数求两个数的较大值
//int Max(int x, int y)
//{
//	if (x > y)
//		//int maxa = x;//从属语句不能是声明？？？
//		return x;
//	else
//		//int maxa = y;//从属语句不能是声明？？？
//		return y;
//	//return maxa;
//}
//
//int main()
//{
//	int num1 = 10;
//	int num2 = 20;
//	/*if (num1 > num2)
//		printf("较大值是：%d\n", num1);
//	else
//		printf("较大值是：%d\n", num2);*/
//	int max = 0;
//	max = Max(num1, num2);//通过他的返回值的方式告诉我较大值 我们用小写的max来接收一下Max这个函数的返回值
//	printf("max = %d\n", max);
//	return 0;
//}

//sizeof单目操作符回顾
//int main()
//{
//	int arr[] = { 1,2,3,4,5,6 };//6*4=24
//	printf("%d\n", sizeof(arr));//计算数组的大小，单位是字节
//	return 0;
//}


// ~单目操作符
//int main()
//{
//	int a = 1;//4个字节，32个bit位
//	int b = ~a;//b其实叫有符号的整形
//	//~ --按(2进制)位取反
//	//1010
//	//0101
//	//00000000000000000000000000000000
//	//(0他的一个二进制序列)
//	//11111111111111111111111111111111
//	//原码、反码、补码
//	//负数在内存中存储的时候，存储的是二进制的补码
//	//11111111111111111111111111111111(内存里面存的是补码)
//	//11111111111111111111111111111110(反码)
//	//10000000000000000000000000000001(原码)
//	printf("%d\n", b);//使用的、打印出的是应该是这个数的原码
//	return 0;
//}
	//int a = 2; 
	//00000000000000000000000000000001
    //11111111111111111111111111111110
    //11111111111111111111111111111101
	//10000000000000000000000000000010
	//打印出来是-2

//不重要的补充
//11111111111111111111111111111111 这个2进制序列代表的是1*2^32-1
//100000000000000000000000000000000
//1*2^32-1

//-1 -- 整型 - 32
//1  -- 整型 - 32
//[1][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][] 负数
//[0][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][] 正数
//正数和负数都是有符号的 有符号数存到内存里面之后我们把他2进制序列里面的最高位给他规定成符号位

//只要是整数，内存中存储的都是二进制的补码
//正数--原码，补码，反码 三码相同 你也可以认为存的是原码 对于负数来说一定存的是补码
//负数：
//原码         -->         反码          -->         补码    
//直接按照正负        原码的符号位不变               反码+1得到的
//写出的二进制序列    其他位按位取反得到的
//-2
//10000000000000000000000000000010 - 原码
//11111111111111111111111111111101 - 反码
//11111111111111111111111111111110 - 补码


//前置、后置++
//int main()
//{
//	int a = 10;
//	int b = a++;//后置++，先使用，再++
//	printf("a = %d b = %d\n", a, b);//11 10
//	return 0;
//}
//int b = ++a;//前置++，先++，再使用
//a = 11 b = 11

//(类型) 强制类型转换
//int main()
//{
//	int a = (int)3.14;//double --> int
//	return 0;
//}

//条件操作符 exp1(表达式1) 也叫三目操作符
//int main()
//{
//	int a = 100;
//	int b = 200;
//	int max = 0;
//
//	max = (a > b ? a : b);
//	
//	/*if (a > b)
//		max = a;
//	else
//		max = b;*/
//	return 0;
//}


// register关键字
//int main()
//{
//	register int a = 10;//建议把a定义成寄存器变量
//	return 0;
//}

//signed关键字
//int main()
//{
//	int a = 10;
//	a = -2;
//	//int定义的变量是有符号的 int其实叫signed int 通常把signed省略掉了
//	unsigned int num = 0;//定义无符号数(无符号的整型) 他这个数字永远都是正数
//	return 0;
//}

//typedef关键字
//int main()
//{
//	//typedef - 类型定义 - 类型重定义(类型重命名)
//	typedef unsigned int u_int;
//	unsigned int num = 20;
//	u_int num2 = 20;
//	return 0;
//}

//static关键字

//1.static修饰局部变量
//局部变量的生命周期变长 出了他的作用域他不再销毁了
//void test()
//{
//	static int a = 1;//当把a加上一个static修饰的时候，我们说这个a就是一个静态的局部变量了
//	a++;
//	printf("a = %d\n", a);
//}
//
//int main()
//{
//	int i = 0;
//	while (i < 5)
//	{
//		test();
//		i++;
//	}
//	//printf("%d\n", a);//错误：未定义标识符"a" (局部变量的生命周期变长，出了他的作用域他不再销毁了)
//	return 0;
//}

//2.static修饰全局变量
//改变了变量的作用域 - 让静态的全局变量只能在自己所在的源文件内部使用 出了源文件就没法再使用了
//int main()
//{
//	//extern - 是用来声明外部符号的
//	extern int g_val;
//	printf("g_val = %d\n", g_val);
//	return 0;
//}

//3.static修饰函数
//也是改变了函数的作用域-这种说法不准确
//static修饰函数改变了函数的链接属性
//正常的一个函数是具有外部链接属性的 -> 变成了内部链接属性

//声明外部函数
extern int Add(int, int);

int main()
{
	int a = 10;
	int b = 20;
	int sum = Add(a, b);
	printf("sum = %d\n", sum);
	return 0;
}


/*
//#define 定义标识符常量
//#define MAX 100

//#define 可以定义宏-带参数
//宏其实是在标识符常量的基础上加了一个参数

//函数的实现
int Max(int x, int y)
{
	if (x > y)
		return x;
	else
		return y;
}

//宏的定义
#define MAX(X,Y) (X>Y?X:Y) //没有参数类型

int main()
{
	//int a = MAX;
	int a = 10;  
	int b = 20;
	//函数
	int max = Max(a, b);
	printf("max = %d\n", max);
	//宏的方式
	max = MAX(a, b);
	//这句话未来会编译器替换成这样子：
	//max = (a>b?a:b);
	printf("max = %d\n", max);
	return 0;
}
*/


//int main()
//{
//	int a = 10;//4个字节
//	int* p = &a;//取出a的地址
//	printf("%p\n", &a);
//	printf("%p\n", p);
//	*p = 20;//* - 解引用操作符/间接访问操作符
//	        //*p其实就是a
//	printf("a = %d\n", a);
//	
//	//有一种变量是用来存放地址的-这种变量就被称为指针变量 指针变量就是专门用来存放地址的 int*是p的类型
//	printf("%p\n", &a);//%p是用打印地址的 可以把地址打印出来看一下
//
//	return 0;
//}

//int main()
//{
//	char ch = 'w';
//	char* pc = &ch;//char*和int* 指针类型的区分
//	printf("%d\n", sizeof(pc));
//	*pc = 'a';
//	printf("%c\n", ch);
//	return 0;
//}

